[
    {
        "q": "I am a 36-year-old married man. I got married some four years back.  I waited for three years and still my wife failed to conceive.  This forced us to approach a fertility clinic where I was told that my body does not produce any semen at all.  The doctors also told me that the only my wife would have to depend on donor sperm if she wants to pregnant.  This revelation has come as a shock to me as I am not comfortable with the donor sperm idea.  Is there any other way to correct my deficiency? Kindly advise me.",
        "a": "Many men who have no sperm in their semen may still be producing them.  There may be adequate sperm production, but due to obstruction or other problems, it may not be coming out.  In such cases, we can retrieve the sperm from inside and successfully produce a pregnancy with their own sperm.  You should have a thorough examination by a team of Andrology and Fertility specialists to find out the reason for your problem and the further course of treatment possible as many such problems do have specific remedies."
    },
    {
        "q": "I’m a 26-year-old spinster who works for a BPO firm based in Bangalore.  These days, I read a lot about pollution, job-related stress and such other things which can have an adverse impact on successful pregnancy.  I planned to get married only after four years and by that time I don’t know whether my body would be able to produce healthy eggs.  Somewhere I read that I could freeze my eggs when I am healthy.  Is it okay to do that? If so, what is the procedure? Do you offer such a facility? Please give me a reply as I am really worried.",
        "a": "First of all, please do not call yourself a Spinster at the age of 26.  The ideal age for having a baby is now thought to be between 25 and 30.  You still have time.  I would not advise egg freezing procedures for you at this time.  Even though we can offer such procedures in appropriate circumstances (eg., women who have to undergo cancer treatment) – in your particular situation, a natural approach would be much more beneficial than what we call social egg freezing.  Anyway for reassure, you can consult a Fertility unit to assess your ovarian reserve or the existing fertility potential."
    },
    {
        "q": "I’m a 25-year-old woman and my husband is 30 years. I got married a year back. I am healthy and so is my husband. We have been trying for a child since Day 1, without any luck. My relatives and friends often ask me why I’m yet to conceive. Such questions are embarrassing us a lot. So, we have not consulted a doctor. My husband does not smoke or drink. So, should we wait for some more time before seeing a doctor?",
        "a": "From your mail, I can see that you are really anxious and under unnecessary stress. Please understand that many normal couples do take about a year or so to achieve pregnancy. So, I don’t see anything unusual in your case and there is no nee for you to get upset or embarrassed at this point. However, if you are still concerned you can approach a good fertility unit to have baseline investigations for both of you. But, a word of caution: keep away from complicated medications and procedures until your investigations are completed."
    },
    {
        "q": "I’m a 33-year-old woman and my husband is 39 years. I got married five years back and I’m still without a child. Our relatives and friends often make fun of me and my husband. We have visited many temples seeking God’s blessings for a child. But our dream is yet to become a reality. My husband smokes about a 15 cigarettes a day and drinks occasionally. Is smoking a reason that prevents successful pregnancy? We have not seen a doctor so far. Should we see a doctor?",
        "a": "First things first! Your husband should understand that smoking not only kills but can also have a debilitating effect on fertility. So, the first step towards successful pregnancy is to stay away from cigarettes and drinks.\nI can see that you and your husband have crossed the age of 30 and have been trying for a child for over 5 years. It is time you approached a good fertility unit. It is necessary that both of you should undergo all the necessary medical investigations. But, there is no need to panic yet since many medical problems could be corrected easily these days with the advances in medical science. But, you should be willing to put in that extra effort to make your dream come true. Please do remember that God Almighty generally helps people who make sincere efforts. All the best to you!"
    },
    {
        "q": "I’m a 45-year-old husband and my wife is 40 years and we are a childless couple. We had earlier visited an infertility clinic in Coimbatore. We went through IUI procedure four times without success. Each time the doctor says, pregnancy will happen in the next session. But, other than paying money heeding to rosy promises there has not been any positive result. What should we do?",
        "a": "The success rate of IUI at the best is ony 20-25%. This, of course, decreases in older couples. Rather than painting a rosy picture, you should have further investigations to assess the underlying problems. You should be given a realistic assessment and guided further in your efforts. Wish you good luck!"
    }
]