[
    {
        "q": "I have been experiencing heavy periods during the last four-five menstrual cycles. The periods are accompanied by unbearable stomach ache. About a month back, I consulted a local gynaecologist and she suggested that I should undergo hysterectomy.  I am only 38 years married and I got married 15 years back. I am scared by what the doctor told me. I am also scared of surgeries and the intensity of my worry only increases by the fact that I have two children who are just into college. Is there any other way to treat my problem or is a surgery absolute necessity? Please advise.",
        "a": "Heavy and painful periods starting in this age group may be due to many reasons such as hormonal dysfunction, fibroids, adenomyosis, polyps, etc.  The first step in the management of this problem should be finding out the reason for these distressing symptoms.  Each one of them needs a different approach.  Hormonal problems can be treated by medicines.  Even fibroids and adenomyosis now are not considered to be reasons for rushing into hysterectomy.  Newer medications and procedures are available.  MRgFUS is a Day procedure which heals this problem without any surgery or anaesthesia.   Please explore all your options prior to opting for a major surgery.  Hysterectomy should only be the very last option and only if absolutely needed."
    },
    {
        "q": "I am a 44-year-old married woman with a grown up son. My husband is 6 years elder to me and we lead a fairly sexually active life. Of late, I, however, have been experiencing shrieking pain while having intercourse. I have been experiencing this pain only for the last four or five months and not before that. Otherwise, I am a healthy female with somewhat regular periods. Because of the pain, I often have to say no to my husband which upsets him. I don’t want to upset him. Same time, I can’t bear this pain either. Is there anyway? I would be really thankful if you could help with your advice. So, I have not consulted a gynaecologist.",
        "a": "Any acute or severe pain in the pelvic area should not be taken lightly.  A thorough physical examination alongwith tests such as Pap Smear and Ultrasound should be carried out to rule out any significant problems.  So, approaching a Gynecologist and carrying out the appropriate test is essential for your problem to be properly solved."
    },
    {
        "q": "I am a 21-year-old spinster. I am a call center employee and I work in shifts. Being a seat-bound job, I don’t have much of physical activity. I am also slightly overweight. But, I am worried about a different issue. Some 10 years back, I had lost my mother after being diagnosed for breast cancer. Recently, my aunt (mother’s younger sister) was also diagnosed with breast cancer. Ever since I heard this news, I have been having sleepless nights. Doctor, is it possible that I too would get breast cancer? My friends tell me that it is hereditary. Is it true? Is there any preventive treatment? I would really thank you for your advice.",
        "a": "Initially to allay your anxiety only 5-10% of breast cancer are hereditary.Although having a family history of breast cancer increases the risk but it does not mean that every lady in family will have the breast cancer. To answer your query correctly few more information are needed like what was your mother&#8217;s age at the time of diagnosis and death? What is your aunt&#8217;s age? etc. Screening is best tool to prevent the breast cancer which in your case can be suggested after detail history.Genetic testing for cancer related genes is now available in India.As your close blood relatives have been diagnosed with breast cancer you should meet the expert for further prevention strategies suitable for you."
    },
    {
        "q": "I got married around a year back and now I am on my family way.  My problem is that I am very lean. Will this affect the health of my baby? How can I put on weight? What should I eat?  Is there any food I should stay from? I would be grateful if you could advise me appropriately.",
        "a": "You should get your Doctor to calculate your BMI (a calculation based on your weight / height ratio).  If your BMI is too low, you should actively try to increase your calorie and protein intake, consult a Dietician, review your current intake and find out ways of optimizing intake. Generally protein rich foods such as milk and milk products, nuts, lentils, eggs and any non-vegetarian food can be beneficial.  Avoid excessive sugars such as biscuits, bakery items, Indian sweets, soft drinks and even excessive fruit juices."
    },
    {
        "q": "I am a 30-year-old married woman.  I conceived my first baby some two years back.  But, it ended in an abortion when I was two months into pregnancy after I slipped inside the bathroom. It was a very painful experience and I am yet to get over its shock.  My husband assures me that it is safe for me to become pregnant again. But, I am not sure.  Should I consult a doctor?  Should I undergo any specific tests?  I hope you will clarify my doubts.",
        "a": "Since your adverse pregnancy outcome was two years ago and you are crossing 30 years, you should try for the next pregnancy without postponing it for too long a period.  Beyond 30, in some women fertility problems can become more common.  Waiting for too long is neither beneficial nor needed after an abortion.  Some information about a miscarriage – it may not be related to your fall at all. The majority of miscarriages happen because the developing baby may not be chromosomally normal and nature usually terminates such pregnancies.Please do see your Gynecologist and do the usual prenatal test such as a physical examination, Hb, blood sugars, thyroid function tests before you start trying.  You should be on vitamin (folic acid) therapy also."
    },
    {
        "q": "I’m a 27-year-old spinster of average height. My problem is that I’m obese. I weigh 95 kilograms. This obesity is giving me lots of problems and affects my day-to-day activities in many ways which I think I don’t need to elaborate. But, my main concern is that no one wants to marry me. During the last two years, at least, three persons came to see me but they backed out after seeing me. To be frank with you, I don’t eat much. I go for daily morning walk. But, nothing seems to help. What should I do to reduce my weight?",
        "a": "Quite obviously you are a young woman with significantly high body weight. I would have liked to know what your height is and what your job and everyday activities are. You should actually calculate your BMI (Body Mass Index) which depends on your height and try to keep your BMI around 25.Before you even start your weight loss routine you have to change your mindset. Your weight loss regimen is urgently required – not because of the society around you, but for your own physical well being. Change your mindset and attitude to positively and a “can-do” attitude. Work with a dietician and fitness trainer. What you basically require is a diet that is focused on Low Carb – High fiber – High protein” and a fitness regimen that includes “Ten thousand steps” a day along with an exercise regimen that is appropriate for you."
    },
    {
        "q": "I’m a 35-year-old married woman with two school-going children. I’ve not undergone family planning operation till now though we don’t want to have more children. So, whenever we have sex (unprotected), I depend on birth control pills. I have been regularly taking birth control pills for the last four years. I’m told that regular intake of these pills can have adverse effects on my health. Is it true? Should I avoid these pills? If I’m not supposed to take them, then what is the other best and safest way to prevent unwanted pregnancy? Please help.",
        "a": "Adverse effect of hormones does increase with increasing age. Emergency contraception or “morning after pills” should not be used for regular contraceptive needs also &#8211; because these involve higher dose of hormones. If you have made the clear decision that you do not need any more children in your life, you should consider safer or more permanent options. These include IUCD with long efficacy periods or permanent methods such as tubectomy for you or vasectomy for your husband."
    },
    {
        "q": "I’m writing this for my 17-year-old college-going daughter. She is about 6 ft tall and is otherwise good-looking. But, the problem is that she is lean and lanky and you can actually see the bones in the hands and legs. I’ve taken her to doctors earlier and I’ve tried every tonic that promises weight gain with no positive results. My daughter is a poor eater and her intake of food is similar to that of a 10-year-old kid. I advise her to eat lots of vegetables but she hates them. She also hates drinking milk. I don’t what to do. I’m desperate, because, I will have to marry her off in the next couple of years. Can you offer me a workable solution?",
        "a": "First of all we should, as a society – get out of the mindset of considering “tonics” as a substitute for food. At best they contain some vitamins and minerals which may be a supplement to a good diet in certain situations.If your daughter is only 17 and is 6’ tall, her body has obviously used her “inadequate diet” for the considerable growth which is just normal in adolescence. A vegetable heavy diet – though good – does not provide all the other necessary elements such as protein, fat, etc. I think both you and your daughter should make an attempt to understand what a good balanced diet is – containing a balanced amount of carbs, fats, proteins and vitamins. A good dietician can help.You may also need to change your idea of what “good looks” are. A fit body with a good posture is definitely more attractive in the long run than a plump rounded one. Please don’t think of getting her “married-off” in the next two years also. As a Gynecologist, I would say that it is far too early."
    },
    {
        "q": "I’m a 40-year-old married woman with two grown up children. These days, I experience burning sensation and uncontrollable itching after sex with my husband.  While the burning sensation evaporates after one or two hours, the itching continues most of the time, especially while passing urine.  It looks really odd when I start scratching my private part particularly when there are others around. But, I’m not able to control it. Should I see a doctor? Do I have HIV? Please help me with an answer as I’m spending sleepless nights over this problem.",
        "a": "You should have a Gynec consultation and a complete examination. Your symptoms are suggestion of a genital tract infection. An examination and appropriate tests will tell you what exactly the problem is and the appropriate treatment can be given. It may be of help if your husband see a Physician as well.Most of these infections are simply curable infections and not HIV – so please see the doctor ASAP rather than spend sleepless nights."
    },
    {
        "q": "I’m a 26-year-old woman. I’m married and two months into my pregnancy now. My husband insists on having sex every day. But, I don’t know whether it is safe to have sex during pregnancy.  I’m scared but my husband says it is okay to have sex. Is he right? Please advise.",
        "a": "Sexual activity is not forbidden during pregnancy. However, your comfort level will have to be taken into consideration. It can give rise to uterine contractions in some women. There may be a medical advice to avoid it in situations such as threatened abortion, bleeding, preterm labour, etc."
    },
    {
        "q": "I’m a 45-year-old married woman. I’ve two grown up sons. For the last few months, I have been experiencing excruciating stomach pain almost every day. I’ve been taking pain killers but so far I have not consulted any doctor. My periods are irregular and the intensity of the pain increases during menstruation period. Should I consult a doctor? Please advise.",
        "a": "It is absolutely necessary for you to have a medical consultation and necessary investigation. “Excruciating pain” should not be considered as normal even if it is associated with your periods. Yearly examinations should be done for all menopausal women – this becomes mandatory if you are symptomatic."
    },
    {
        "q": "I’m a 26-year-old unmarried woman. I’m good looking, fair and healthy with a proper BMI.  But, my problem is that my breasts too small. The problem becomes noticeable, when I wear tight outfits. My friends tease me and say that no man would fall in love with me or marry me because my breasts are not large. I’ve been taking healthy food but it has not helped in the enlargement of the breasts. Is there anyway, I can get my breast enlarged? If yes where should I visit and what would be the financial impact?",
        "a": "Large breasts need not be considered as a marker for either good looks or normal life. Smaller breasts are absolutely compatible with normal sexual life and normal breast feeding later. You just have to choose the right attire to accentuate your positive features."
    },
    {
        "q": "I’m a 49-year-old married woman with three grown-up children. Of late, my periods have become irregular. For the last few months, I have been going through a lot of mental trauma during periods. I feel lonely and get easily angry and detest the presence of my husband. I don’t know how to explain this situation. But, I become normal once the menstruation period ends. Am I suffering from some psychological problems? Please help with an appropriate reply since my relationship with my husband has come under strains like never before.",
        "a": "You are probably going through what is generally called a “mid-life crisis” . It is usually secondary to hormonal changes and other changes in your life such as medical problems, children leaving home, change in the social situations, etc. It is best to have a check up at Institutions that deal with such problems – menopause clinics. The Management may consist of appropriate medications, if necessary, exercises, diet counseling and professional emotional counseling, etc."
    },
    {
        "q": "I’m a 24-year-old IT professional. I’m single now and expecting to get married next year.  I’ve been smoking about 10 cigarettes a day for the last two years. Occasionally, I also drink. My friends tell me that smoking and drinking can have an adverse effect on the foetus when I get pregnant. Is it true? Would reducing the number of cigarettes help? Please help.",
        "a": "A lot of trendy habits that we pick up at a certain stage of our life may turn out to be our night mare in the future. It is absolutely important for you to quit smoking entirely, not only for the sake of a future pregnancy, but for your own future well being. Alcohol during pregnancy can also produce abnormalities called “Foetal Alcohol Syndrome” and is better to be avoided. But again, it is just not a future pregnancy , but the adverse effect on you that you should be aware of."
    },
    {
        "q": "First of all, Happy Women’ Day ma’am. I’m a 24 year old accountant. My family has recently started searching a groom for me. However, I have some doubt regarding familial breast cancer risks. Last year, my maternal aunt had done a mammogram followed by an ultrasound and found that she had two cysts on her left breast. She had been undergoing treatment and monthly checks ever since. I have heard that breast cancer could be hereditary. So should I be worried? Should I get a mammogram?",
        "a": "Thanks for wishes. As per your version your aunt has been diagnosed with breast cyst which does not mean that she is having breast cancer. Breast cyst is a fluid filled cavity which is usually harmless. As such simple breast cyst does not increase the risk of breast cancer, but serial examination by expert is advised if its troublesome because of size, pain or in case of strong family history of breast cancer. Regarding familial breast cancer it contributes only 10-15% of cases. You should not be worried if your aunt is having only simple cyst. Mammogram is not recommended in your age group. Definitely you should start self breast examination as you are above 20 years. You can take advise of an expert regarding the same."
    },
    {
        "q": "I’m a 20 year old college student. I have regular periods with 30-32 day cycle. For the last two months, I have been suffering from severe itching on both my breasts. Ever since the last periods, that was two weeks ago, I also have minor nipple discharge. Is it normal? Should I see a doctor? I am really worried. Please help.",
        "a": "Do you have only itching or any redness,swelling associated with it? Have you got new undergarments, perfume or body lotion? So usually itching in both the breast diffusely may be because of allergy to anything new you came in contact with. Sometimes too tight garments, hot and humid weather can cause the same. Regarding nipple discharge it is not alarming as per your history. You should consult a doctor to clarify both the problems. As assessment of nature, color, single or multiple duct discharge and associated changes is necessary."
    },
    {
        "q": "Hi, I am a 38 years old teacher. Recently I have been experiencing certain changes in my body like delayed periods, tenderness in breasts, fatigue and frequent urge to urinate. My mother told me that those are the symptoms of menopause. Am I having a premature menopause? Can I get treatment for it? Please help doctor.",
        "a": "The average age of menopause in the west is 52. The reported average age in India is lower at around 47 years. The first change that most women notice is a change in the pattern of menstrual cycles. With the onset of changes in the hormonal functions, the cycles become irregular, either too short or too long intervals in between. This is not an abnormality and generally need not be corrected unless the bleeding is excessive. However, the other changes that you have mentioned are not typical of menopausal symptoms. Urinary tract infection, abnormalities in other hormonal levels such as thyroid should be ruled out also."
    },
    {
        "q": "Hi doctor. I am 25 years old and got married four months ago. I had this migraine problem when I was in school. I used to have acute headaches that last up to a whole day, but not anymore. However, for the past couple of times, I experienced severe headaches after having sexual intercourse. Is the two connected? Is my migraine is making a comeback? Should I consult a doctor?",
        "a": "Migraines may be triggered by a whole variety of physical, emotional, dietary, environmental factors. Anxiety, tension, etc., can also be a factor. If the headaches are severe , recurrent or troublesome, you should consult at doctor."
    },
    {
        "q": "Hi doctor. I am the mother of 14-year-old girl. Despite how much sleep she gets, she always seems so tired. All sorts of blood tests have been done and she seems fine except for occasional tonsillitis problems. No matter how much time he sleeps, she is always seems so sleepy. She started menstruating an year ago and the cycle is almost regular with no visible problems. Is this part of growing up? Could she be anaemic?",
        "a": "You should make sure that she does not have low levels of hemoglobin (anemia), thyoxine, sugar, calcium, etc., with blood tests. Lack of exercise also can lead to low metabolic levels and sleepiness. Sometimes day time sleepiness can result from lack of deep sleep through the night. Obesity, snoring, etc., can lead to this problem."
    },
    {
        "q": "Hi doctor. I am a 24-year-old working woman. I had having a healthy sex life and normal periods cycle. But ever since the beginning of this summer, I have been experiencing dryness in my vagina which makes sex really hard and painful for me. Except that, my body is fine. Is it due to the weather or some hormonal changes? I don’t want to use any lubricants. Can you help me suggest how to solve this issue? Are there any medicines that I can take or any particular diet I should follow? Please reply.",
        "a": "Dryness and discomfort in the vagina in a young woman with normal periods is unlikely to be due to any major change in hormonal levels. It is much more likely to be secondary to a possible vaginal infection-often a mild one such as fungal infection. It will be wise to have your Gynecologist check you and perform routine tests such as a culture, pap smear, etc. Local treatment alone can give relief to the megonty of such common infections. Dietary changes will not make any difference. Using appropriate cleaning solutions routinely can prevent these infections. You can ask your Gynecologist to prescribe the right agent for you."
    }
]